{
  "_name_or_path": "emilyalsentzer/Bio_ClinicalBERT",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-problem",
    "2": "I-problem",
    "3": "B-treatment",
    "4": "I-treatment",
    "5": "B-test",
    "6": "I-test",
    "7": "B-drug",
    "8": "I-drug"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-drug": 7,
    "B-problem": 1,
    "B-test": 5,
    "B-treatment": 3,
    "I-drug": 8,
    "I-problem": 2,
    "I-test": 6,
    "I-treatment": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.34.0.dev0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
